#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=40d3ec352b98c18d5b8da5c117c3f031d74c0b5a]
data.aws_cloudfront_origin_request_policy.site: Reading...
aws_s3_bucket.site: Refreshing state... [id=kcirtap.io]
aws_cloudfront_origin_access_identity.site: Refreshing state... [id=E2C8GDW3F1IOE3]
aws_iam_role.lambda_exec: Refreshing state... [id=lambda_exec]
data.aws_cloudfront_response_headers_policy.site: Reading...
data.aws_cloudfront_cache_policy.site: Reading...
data.aws_route53_zone.site: Reading...
data.aws_cloudfront_response_headers_policy.site: Read complete after 0s [id=eaab4381-ed33-4a86-88ca-d9558dc6cd63]
data.aws_cloudfront_origin_request_policy.site: Read complete after 0s [id=33f36d7e-f396-46d9-90e0-52428a34d9dc]
data.aws_cloudfront_cache_policy.site: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_lambda_function.lambda_at_edge: Refreshing state... [id=LambdaAtEdge]
aws_cloudfront_origin_access_control.site: Refreshing state... [id=E10QTLXN06ZLZM]
aws_s3_bucket_ownership_controls.site: Refreshing state... [id=kcirtap.io]
aws_s3_bucket_website_configuration.site: Refreshing state... [id=kcirtap.io]
aws_s3_bucket_acl.site: Refreshing state... [id=kcirtap.io,private]
data.aws_route53_zone.site: Read complete after 0s [id=Z0925866K024YRD6EBOT]
aws_acm_certificate.site_cert: Refreshing state... [id=arn:aws:acm:us-east-1:631342039360:certificate/d0da8c22-b330-4f38-91f2-5caf79d70bb2]
aws_route53_record.cert_validation["kcirtap.io"]: Refreshing state... [id=Z0925866K024YRD6EBOT__2b78fe36ca6155eba4073742ee18526b.kcirtap.io._CNAME]
aws_acm_certificate_validation.site_cert_validation: Refreshing state... [id=2023-05-01 19:49:01.928 +0000 UTC]
aws_cloudfront_distribution.site_distribution: Refreshing state... [id=E1MS8SPVA2H1K3]
aws_route53_record.site_AAAA: Refreshing state... [id=Z0925866K024YRD6EBOT_kcirtap.io_AAAA]
aws_s3_bucket_policy.site_public_read: Refreshing state... [id=kcirtap.io]
aws_route53_record.site_A: Refreshing state... [id=Z0925866K024YRD6EBOT_kcirtap.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.site_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "site_distribution" {
        id                             = "E1MS8SPVA2H1K3"
        tags                           = {
            "Terraform" = "true"
        }
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl            = 0 -> 86400
          ~ max_ttl                = 0 -> 31536000
            # (10 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:631342039360:function:LambdaAtEdge:1" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.lambda_at_edge will be updated in-place
  ~ resource "aws_lambda_function" "lambda_at_edge" {
        id                             = "LambdaAtEdge"
      ~ last_modified                  = "2023-05-07T20:48:51.047+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:631342039360:function:LambdaAtEdge:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:631342039360:function:LambdaAtEdge:1/invocations" -> (known after apply)
      ~ source_code_hash               = "Z1sLdMaLiIQyyFQMqiJTQWGbOyHNzvgw5C9tYJt5nrI=" -> "jOWZ5pJA08H5//269UvOVQpCYWpCHm7brVIN7RQLiQY="
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kcirtapfromspace, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Blog`*